# Implementing Dataframe

In [1]:
import pandas as pd
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
df = pd.DataFrame(dict)
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [2]:
df.shape # Dimension

(4, 3)

In [3]:
rows, cols = df.shape

In [4]:
rows

4

In [5]:
cols

3

In [6]:
df.head(2)

     name degree  score
0  aparna    MBA     90
1  pankaj    BCA     40

In [7]:
df.tail(2)

     name  degree  score
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [8]:
df[1:3]

     name  degree  score
1  pankaj     BCA     40
2  sudhir  M.Tech     80

In [10]:
df.columns

Index(['name', 'degree', 'score'], dtype='object')

In [11]:
df.score

0    90
1    40
2    80
3    98
Name: score, dtype: int64

In [12]:
df[["name", "score"]]

     name  score
0  aparna     90
1  pankaj     40
2  sudhir     80
3   Geeku     98

In [13]:
df["score"].max()

98

In [14]:
df["score"].min()

40

In [15]:
df["score"].mean()

77.0

In [16]:
df.describe()

           score
count   4.000000
mean   77.000000
std    25.742313
min    40.000000
25%    70.000000
50%    85.000000
75%    92.000000
max    98.000000

In [18]:
df[df.score>80]

     name degree  score
0  aparna    MBA     90
3   Geeku    MBA     98